<template>
    <common-knowledge :imgContent="imgContent" :asideContent="asideContent">
        <h2 slot="title">关键词</h2>
        <ul slot="list">
            <li>抚育幼雏</li>
            <li>双重呼吸</li>
            <li>体内受精</li>
            <li>变温动物</li>
            <li>恒温动物</li>
            <li>终生生活在水中</li>
            <li>胎生,哺乳</li>
            <li>食肉</li>
            <li>其他</li>
        </ul>
    </common-knowledge>
</template>

<script>
    import CommonKnowledge from '../../components/knowledge'
    export default {
        name: "Encyclopedias",
        data() {
            return {
                imgContent:[{
                    title:"已经灭绝的动物——金蟾蜍(1989年)",
                    imgUrl:"https://gss1.bdstatic.com/9vo3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=791c4fe24c086e066aa8384d3a331cc9/9358d109b3de9c8210dd2a5c6c81800a18d843ad.jpg",
                    event:"金蟾蜍是过去40年中消失的物种中最美的一种。金蟾蜍因全身呈金黄色和皮肤光泽明亮而闻名，这种会发光的两栖类动物最早是在哥斯达黎加的高海拔地区发现的，曾大量存在于哥斯达黎加蒙特维多云雾森林。金蟾蜍由被人类发现至灭绝仅数十年时间，1989年以后，金蟾蜍再没有被发现。据说，金蟾蜍为哥斯达黎加第一个因全球变暖而灭绝的物种。"
    
                },{
                    title:"已经灭绝的动物——桑给巴尔豹",
                    imgUrl:"https://gss0.bdstatic.com/-4o3dSag_xI4khGkpoWK1HF6hhy/baike/s%3D220/sign=8c1bc795bc315c6047956cedbdb3cbe6/4610b912c8fcc3ceaf18a2b39245d688d53f2051.jpg",
                    event:"当地人认为这种豹是被巫术控制了，所以大肆猎捕它们。这种动物被视为邪恶的掠夺者，所以必须被捕杀。甚至连政府都参与到这场捕杀行动中来。在20世纪90年代中期曾经有过短暂保护措施，但是那时已经为时过晚了，野生动物研究人员断定桑给巴尔豹的长期生存前景十分渺茫，对其进行保护的工作也因此搁浅。"
    
                },{
                    title:"五彩金刚鹦鹉",
                    date:"百科 2018-10-10 16:59",
                    imgUrl:"http://www.ynzoo.cn/uploads/allimg/150722/1-150H219411cI.jpg",
                    event:"羽色鲜艳，产于美洲热带地区，是色彩最漂亮、体型最大的鹦鹉之一，面部无羽毛，布满了条纹，有点像京剧中的花脸脸谱，兴奋时可变为红色。尾极长，属大型攀禽。食谱由许多果实和花朵组成，食量大，有力的喙可将坚果啄开，用钝舌吸出果肉。产于美洲热带地区，在河岸的洞里筑巢。比较容易接受人的训练，和其他种类的鹦鹉能够友好相处，但也会咬其他动物和陌生人。寿命最长可达80年。"
                },{
                    title:"双角犀鸟",
                    date:"百科 2018-10-31 06:40",
                    imgUrl:"http://www.ynzoo.cn/uploads/allimg/150723/1-150H3101F5360.JPG",
                    event:"双角犀鸟在我国产于云南西部、西南部及西藏东南部低地常绿林的罕见留鸟。双角犀鸟因头上的盔比较大分出两杈很象两个角因此而得名。滥猎导致双角犀鸟从许多栖息地消失。通常成对。吵闹着飞过林顶。取食和栖息于原始林，国家二级保护动物，国际附录I物种。主要栖息于海拔1500米以下的低山和山脚平原常绿阔叶林，尤其喜欢靠近湍急溪流的林中沟谷地带。分布于中国、印度、缅甸、泰国、中南半岛、马来西亚和印度尼西亚。"
                },{
                    title:"鸸鹋",
                    date:"百科 2018-10-30 06:40",
                    imgUrl:"http://www.ynzoo.cn/uploads/allimg/150722/1-150H2192GS95.jpg",
                    event: "鸟纲鸸鹋科唯一的物种，以擅长奔跑而著名，是澳洲地区的特产，是世界上第二大的鸟类，体型仅次于非洲鸵鸟，因此也被称作澳洲鸵鸟，也被称作尤加利鸟，翅膀比非洲鸵鸟和美洲鸵鸟的更加退化，足三趾，是世界上最古老的鸟种之一。栖息于澳洲森林和开阔地带，吃树叶和野果。鸸鶓终生配对。每窝产7-10枚暗绿色卵，卵长13cm。在地面上筑巢。雄鸟孵卵约60天。体上有条纹的幼雏出壳后很快就能跟着成鸟跑。"
                },{
                    title:"大熊猫",
                    date:"百科 2018-10-21 11:00",
                    imgUrl:"http://www.ynzoo.cn/uploads/allimg/150723/1-150H3095112T2.jpg",
                    event:"属于食肉目、大熊猫科的一种哺乳动物，体色为黑白两色，它有着圆圆的脸颊，大大的黑眼圈，胖嘟嘟的身体，标志性的内八字的行走方式，也有解剖刀般锋利的爪子。是世界上最可爱的动物之一。大熊猫已在地球上生存了至少800万年，被誉为“活化石”和“中国国宝”，世界自然基金会的形象大使，是世界生物多样性保护的旗舰物种。据第三次全国大熊猫野外种群调查，全世界野生大熊猫不足1600只，属于中国国家一级保护动物。截止2011年10月，全国圈养大熊猫数量为333只。大熊猫最初是吃肉的，经过进化，99%的食物都是竹子了，但牙齿和消化道还保持原样，仍然划分为食肉目。野外大熊猫的寿命为18～20岁，圈养状态下可以超过30岁。是中国特有种，现存的主要栖息地是中国四川、陕西和甘肃的山区。"
                },{
                    title:"梅花鹿",
                    date:"百科 2018-10-18 20:09",
                    imgUrl:"http://www.ynzoo.cn/uploads/allimg/150722/1-150H219232O15.jpg",
                    event:"梅花鹿主要分布在日本、朝鲜、俄罗斯和中国，特别在中国曾广泛分布，但由于长期遭到不法分子的捕杀，目前野生数量仅几百只。梅花鹿是一种中型鹿，仅雄鹿有角。因它们全身红棕色的夏毛中杂有显著的白色斑点，形似梅花状而得名。但一到冬天为了抵御寒冷的气候全身毛色变成栗棕色，白斑就此隐去。梅花鹿主要生活在树林边缘和山地草原地区，以青草、树叶为食，好舔食盐。 "
                },{
                    title:"白虎",
                    date:"百科 2018-10-15 14:35",
                    imgUrl:"http://www.ynzoo.cn/uploads/allimg/150722/1-150H2194605F7.jpg",
                    event:"虎中罕见的色型，它的毛色并不像白狐、白兔那样雪白，而是很淡的乳白色，长有深褐色的横纹，桃红色的鼻子和虎掌，两只眼睛在阳光下好似透明无色，但在背光处却呈浅蓝色。这样的白虎在我国古书上有许多记述，但从来没人抓获过或拍到过白虎的照片。"
                },{
                    title:"浣熊",
                    date:"百科 2018-10-11 21:20",
                    imgUrl:"http://www.ynzoo.cn/uploads/allimg/150722/1-150H21951401S.jpg",
                    event:"尾巴短，有一圈圈条纹，戴着一副黑眼罩——它来自美洲。浣熊非常爱干净，进食之前会将手和食物清洗干净。它的前肢趾长，能像人类的手指一样张开并能灵活使用，后肢的脚印几乎和人一样。浣熊宝宝可爱的模样很受小朋友喜欢。"
                }],
                asideContent:[{
                    title:"不一样的动物主题世界，没去过这儿你就out了",
                    imgUrl:"http://www.ynzoo.cn/templets/moban/images/banner_4.jpg",
                    content:"你是否曾想去大洋深处，与各色各样的海底生物来个亲密接触？你是否曾想去热带雨林，领略那些雨林动物五彩斑斓的奇特身姿？你是否曾想去草原牧场，与羊驼、短腿马来张亲密合照？你是否曾经幻想鸟儿们在身边嬉戏，让你能够亲手给它们喂食？你是否也对各类萌萌的小动物喜爱有加？这些梦想，在艾妮茉动物主题乐园都可以为您一一实现!"
                },{
                    title:"西藏阿里:野生动物的乐园",
                    imgUrl:"http://www.ynzoo.cn/templets/moban/images/banner/about_bg.png",
                    content:"阿里地处西藏西部，平均海拔4500米以上，面积30多万平方公里，羌塘国家级自然保护区几乎涵盖整个阿里地区，是众多野生动物生活的乐园。阿里还是世界上海拔最高的天然野生动物乐园。近年来，阿里地区境内野生动物数量逐年增多，在这海拔近五千米的雪域高原，生长着各类适应性极强的高原植物和野生动物。"
                }]
            
            }
        },
        components:{
            CommonKnowledge
        }
    }
</script>

<style lang="stylus" scoped>

</style>
